# BuiltInFailures.ToggleViewFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ToggleViewFailures Class
BuiltInFailures Class Members See Also
---
Failures about ToggleView.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ToggleViewFailures
```

Visual Basic
---
```text
Public NotInheritable Class ToggleViewFailures
```

Visual C++
---
```text
public ref class ToggleViewFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ToggleViewFailures
# See Also
BuiltInFailures..::..ToggleViewFailures Members
Autodesk.Revit.DB Namespace